
lesson1 = [['a',u'កូន​ដៃ',u'ា'],['s',u'នាង​ដៃ',u'ស'],['d','ចង្អុលកណ្តាល','ដ'],['f','ចង្អុលដៃ','ថ'],['g','ចង្អុលដៃ','ង'],
    ['h','ចង្អុល​ដៃ​ស្តាំ','ហ'],['j','ចង្អុល​ដៃ​ស្តាំ','្'],['k','ចង្អុលកណ្តាល','ក'],['l','នាងដៃ','ល'],[';','កូនដៃ','ើ'],
    ["'",'កូនដៃ','់'],['SPACE','មេដៃស្តាំ','']]

lesson2 = [['/','កូនដៃ','៊'],['.','នាងដៃ','។'],[',','ចង្អុលកណ្តាល','ុំ'],['m','ចង្អុលដៃ','ម'],['n','ចង្អុលដៃ','ន'],['b','ចង្អុលដៃឆ្វេង','ប'],
    ['v','ចង្អុលដៃឆ្វេង','វ'],['c','ចង្អុល​កណ្តាល','ច'],['x','នាងដៃ','ខ'],['z','កូនដៃ','ឋ'],['SPACE','មេដៃ​ឆ្វេង','​']]

lesson3 = [['q','កូន​ដៃ','ឆ'],['w','នាង​ដៃ','ឹ'],['e','ចង្អុល​កណ្តាល','េ'],['r','ចង្អុលដៃ','រ'],['t','ចង្អុលដៃ','ត'],['y','ចង្អុល​ដៃ​ស្តាំ','យ'],
    ['u','ចង្អុលដៃ​ស្តាំ','ុ'],['i','ចង្អុល​កណ្តាល','ិ'],['o','នាងដៃ','ោ'],['p','កូនដៃ','ផ'],['[','កូនដៃ','ៀ'],[']','កូនដៃ','ឪ'],
    ['SPACE','មេដៃ​ស្តាំ','​']]

lesson4 = [['=','កូនដៃ','ឲ'],['-','កូនដៃ','ឥ'],['0','កូនដៃ','០'],['9','នាង​ដៃ','៩'],['8','ចង្អុល​កណ្តាល','៨'],['7','ចង្អុលដៃ','៧'],
    ['6','ចង្អុលដៃ','៦'],['5','ចង្អុល​ដៃឆ្វេង','៥'],['4','ចង្អលដៃ​ឆ្វេង','៤'],['3','ចង្អុល​កណ្តាល','៣'],['2','នាង​ដៃ','២'],['1','កូនដៃ','១'],
    ['`','កូនដៃ','«'],['SPACE','មេដៃ​ឆ្វេង','​']]

lesson5 = [['A','Shift+កូនដៃ','ាំ'],['S','Shift+នាងដៃ','ៃ'],['D','Shift+ចង្អុលកណ្តាល','ឌ'],['F','Shift+ចង្អុលដៃ','ធ'],['G','Shift+ចង្អុលដៃ','អ'],
    ['H','shift+ចង្អុលដៃ​ស្តាំ','ះ'],['J','Shift+ចង្អុលដៃស្តាំ','ញ'],['K','Shift+ចង្អុលដៃ','គ'],['L','Shift+នាងដៃ','ឡ'],[':','Shift+កូនដៃ','ោះ'],
    ['"','Shift+កូនដៃ','៉'],['SPACE','មេដៃស្តាំ','']]