
lesson1 = [['A',u'កូន​ដៃ',u'ា'],['S',u'នាង​ដៃ',u'ស'],['D','ចង្អុលកណ្តាល','ដ'],['F','ចង្អុលដៃ','ថ'],['G','ចង្អុលដៃ','ង'],
    ['H','ចង្អុល​ដៃ​ស្តាំ','ហ'],['J','ចង្អុល​ដៃ​ស្តាំ','្'],['K','ចង្អុលកណ្តាល','ក'],['L','នាងដៃ','ល'],[';','កូនដៃ','ើ'],
    ["'",'កូនដៃ','់'],['Space','មេដៃស្តាំ','']]

lesson2 = [['/','កូនដៃ','៊'],['.','នាងដៃ','។'],[',','ចង្អុលកណ្តាល','ុំ'],['M','ចង្អុលដៃ','ម'],['N','ចង្អុលដៃ','ន'],['B','ចង្អុលដៃឆ្វេង','ប'],
    ['V','ចង្អុលដៃឆ្វេង','វ'],['C','ចង្អុល​កណ្តាល','ច'],['X','នាងដៃ','ខ'],['Z','កូនដៃ','ឋ'],['Space','មេដៃ​ឆ្វេង','​']]