
lesson1 = [['A',u'កូន​ដៃ',u'ា'],['S',u'នាង​ដៃ',u'ស'],['D','ចង្អុលកណ្តាល','ដ'],['F','ចង្អុលដៃ','ថ'],['G','ចង្អុលដៃ','ង'],
    ['H','ចង្អុល​ដៃ​ស្តាំ','ហ'],['J','ចង្អុល​ដៃ​ស្តាំ','្'],['K','ចង្អុលកណ្តាល','ក'],['L','នាងដៃ','ល'],[';','កូនដៃ','ើ'],
    ["'",'កូនដៃ','់'],['Space','មេដៃស្តាំ','']]

lesson2 = [['/','កូនដៃ','៊'],['.','នាងដៃ','។'],[',','ចង្អុលកណ្តាល','ុំ'],['M','ចង្អុលដៃ','ម'],['N','ចង្អុលដៃ','ន'],['B','ចង្អុលដៃឆ្វេង','ប'],
    ['V','ចង្អុលដៃឆ្វេង','វ'],['C','ចង្អុល​កណ្តាល','ច'],['X','នាងដៃ','ខ'],['Z','កូនដៃ','ឋ'],['Space','មេដៃ​ឆ្វេង','​']]

lesson3 = [['Q','កូន​ដៃ','ឆ'],['W','នាង​ដៃ','ឹ'],['E','ចង្អុល​កណ្តាល','េ'],['R','ចង្អុលដៃ','រ'],['T','ចង្អុលដៃ','ត'],['Y','ចង្អុល​ដៃ​ស្តាំ','យ'],
    ['U','ចង្អុលដៃ​ស្តាំ','ុ'],['I','ចង្អុល​កណ្តាល','ិ'],['O','នាងដៃ','ោ'],['P','កូនដៃ','ផ'],['[','កូនដៃ','ៀ'],[']','កូនដៃ','ឪ'],
    ['Space','មេដៃ​ស្តាំ','​']]

lesson4 = [['=','កូនដៃ','ឲ'],['-','កូនដៃ','ឥ'],['0','កូនដៃ','០'],['9','នាង​ដៃ','៩'],['8','ចង្អុល​កណ្តាល','៨'],['7','ចង្អុលដៃ','៧'],
    ['6','ចង្អុលដៃ','៦'],['5','ចង្អុល​ដៃឆ្វេង','៥'],['4','ចង្អលដៃ​ឆ្វេង','៤'],['3','ចង្អុល​កណ្តាល','៣'],['2','នាង​ដៃ','២'],['1','កូនដៃ','១'],
    ['`','កូនដៃ','«'],['Space','មេដៃ​ឆ្វេង','​']]